Revit 2026 API
ParameterDownloadOptions Class
 An option class used for downloading parameters from the Parameters Service.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ParameterDownloadOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class ParameterDownloadOptions : IDisposable
Public Class ParameterDownloadOptions
	Implements IDisposable
public ref class ParameterDownloadOptions : IDisposable
type ParameterDownloadOptions =
    class
        interface IDisposable
    end
The ParameterDownloadOptions type exposes the following members.
Constructors
Name | Description
ParameterDownloadOptions() |  Default constructor.
ParameterDownloadOptions(ISet<ElementId>, Boolean, Boolean, ForgeTypeId) | Initializes a new instance of the ParameterDownloadOptions class
Top
Properties
Name | Description
IsInstance |  True if binding to Element instances, false if binding to Element types.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Visible |  True if the parameter is visible to the user, false if it is hidden and accessible only via the API.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ParameterDownloadOptions
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetCategories |  Get categories for binding.
GetGroupTypeId |  Get properties palette group identifier.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetCategories
SetGroupTypeId |  Set properties palette group identifier.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace